import React, { useState } from "react";
import {
  Container,
  Typography,
  Box,
  Button,
  Checkbox,
  FormControlLabel,
  Card,
  CardContent,
  Paper,
} from "@mui/material";
import MKBox from "components/MKBox";
// Material Kit 2 React examples
import DefaultNavbar from "examples/Navbars/DefaultNavbar";
import MKTypography from "components/MKTypography";

// Routes
import routes from "routes";
// Images
import bgImage from "assets/images/hospital.png";

function Agreement() {
  const [isChecked, setChecked] = useState(false);
  const [data] = useState([
    " 1. บริการ",
    "     ก.) Smart Appointments (นัดหมายออนไลน์) เป็นบริการที่จะช่วยเชื่อมคุณเข้าถึงบริการด้านการแพทย์คุณภาพและการดูแลสุขภาพได้ทั้งในรูปแบบออนไลน์ (Online) ผ่านบัญชีทางการของ LINE สำหรับธุรกิจ @ksbrhospital ของเรา (“แอปพลิเคชัน”) หรือ เว็บไซต์ของเรา (“เว็บไซต์”) และ จุดให้บริการของเราที่ตั้งอยู่ ณ สถานที่ต่าง ๆ (“จุดบริการ”) ซึ่งประกอบไปด้วยบริการ ดังต่อไปนี้",
    "         1. บริการการแพทย์ทางไกล (Smart Appointments)",
    "         2 บริการอื่น ๆ ที่อาจเพิ่มเติมในภายหลัง",
    "     ข.) คุณตกลงและรับทราบว่า ในบริการนี้ บริษัทศรีบุรินทร์การแพทย์แต่เพียงผู้เดียวเป็นผู้รับผิดชอบในบริการที่ต้องดำเนินการโดยผู้ประกอบกิจการสถานพยาบาลตามที่กฎหมายกำหนด ",
    "     ค.) ในบางบริการของเรา คุณจำเป็นต้องลงทะเบียนและเข้าใช้งานด้วยแอปพลิเคชันให้เรียบร้อยก่อนจึงจะสามารถใช้บริการได้",
    "     ง.) ขณะใช้บริการของเรา คุณอาจต้องให้ความตกลงยินยอมในข้อกำหนดและเงื่อนไขการใช้บริการนั้น ๆ ซึ่งอาจเป็นของเราหรือของคู่ค้าของเรา หากคุณไม่ให้ความตกลงยินยอมคุณอาจไม่สามารถใช้บริการและ/หรือผลิตภัณฑ์นั้น ๆ ได้",
    "     จ.)หลังจากเสร็จสิ้นบริการในข้อ 1.ก (1) แล้ว คุณจะได้รับสรุปคำแนะนำจากการใช้บริการ ทั้งนี้เอกสารดังกล่าวไม่ใช่ใบรับรองแพทย์แต่ประการใด",
    "     ฉ.) หากคุณต้องการรับใบรับรองแพทย์ กรุณาแจ้งให้เราทราบในขั้นตอนการนัดหมายพบแพทย์ภายในแอปพลิเคชันก่อนการใช้บริการ",
    " 2. บัญชีผู้ใช้ของคุณ",
    "     ก.) คุณจำเป็นต้องเปิดบัญชีผู้ใช้บริการ (“บัญชีผู้ใช้”) ก่อนใช้บริการของเราผ่านแอปพลิเคชัน",
    "     ข.) คุณตกลงที่จะไม่สร้างบัญชีมากกว่าหนึ่งบัญชี หรือสร้าง บัญชีให้แก่บุคคลอื่นที่ไม่ใช่ตัวเองโดยไม่ได้รับอนุญาตจากบุคคลอื่นนั้นเสียก่อน นอกเหนือจากบัญชีย่อยที่ตั้งขึ้นสำหรับผู้เยาว์ซึ่งคุณเป็นผู้ปกครองตามกฎหมาย",
    "     ค.) คุณยืนยันและรับรองว่า คุณได้ให้ข้อมูลที่แท้จริง ถูกต้อง ครบถ้วน เป็นปัจจุบัน และไม่ก่อให้เกิดความเข้าใจผิดแก่เรา รวมถึงรักษาและปรับข้อมูลของคุณที่ให้แก่เราให้เป็นปัจจุบันโดยทันทีทุกครั้งที่คุณเข้าสู่ระบบ",
    "     ง.) คุณอาจใช้บัญชีผู้ใช้ของโซเชียลมีเดียที่บริการรองรับ หรือ ใช้หมายเลขโทรศัพท์ของคุณในการสร้างบัญชีผู้ใช้เพื่อเข้าใช้บริการนี้ ขอให้คุณกรุณาตรวจสอบเงื่อนไขการใช้บริการและประกาศนโยบายความเป็นส่วนตัวของโซเชียลมีเดียที่คุณเลือกใช้ รวมถึงประกาศนโยบายความเป็นส่วนตัวที่เรากำหนดไว้โดยละเอียด",
    "     จ.) เพื่อปกป้องบัญชีผู้ใช้ของคุณ โปรดเก็บรักษาชื่อผู้ใช้ รหัสผ่าน และสิ่งอื่นใดที่จำเป็นในการเข้าถึงบัญชีผู้ใช้ของคุณเป็นความลับ คุณมีความรับผิดชอบต่อกิจกรรมที่เกิดขึ้นบนหรือผ่านบัญชีผู้ใช้ของคุณ รวมถึงการไม่ใช้รหัสผ่านบัญชีผู้ใช้ซ้ำบนแอปพลิเคชันอื่นใด และไม่ใช้รหัสผ่านบัญชีผู้ใช้ที่เป็นคำทั่วไปหรือคำที่สามารถคาดเดาได้ง่ายโดยเฉพาะจากข้อมูลส่วนตัวของคุณ",
    "     ฉ.) บัญชีผู้ใช้จะยังคงเป็นของคุณ ถึงแม้ว่าจะมีบริการบางส่วนหรือทั้งหมดที่ทำการสั่งซื้อโดยผู้อื่นสำหรับคุณก็ตาม",

    " 3. การใช้บริการ",
    "     ก.) คุณต้องเป็นผู้มีอายุไม่ต่ำกว่า 20 ปีบริบูรณ์ และมีความสามารถในการเข้าทำนิติกรรม และปฏิบัติตามข้อกำหนดและข้อบังคับต่าง ๆภายใต้กฎหมายไทย จึงจะสามารถใช้บริการนี้ได้ด้วยตนเอง",
    "     ข.) หากคุณเป็นผู้มีอายุต่ำกว่า 20 ปีบริบูรณ์ (“ผู้เยาว์”) และมีความจำเป็นต้องการใช้บริการ บุคคลผู้บรรลุนิติภาวะตามกฎหมายในฐานะบิดา มารดา หรือผู้ปกครองโดยชอบด้วยกฎหมายของคุณ (“ผู้ปกครอง”) จะต้องอยู่ด้วยขณะที่ใช้บริการ และผู้ปกครองได้ทำความเข้าใจและตกลงยอมรับเงื่อนไขการใช้บริการ และผู้ปกครองสามารถลงทะเบียนและใช้บริการนี้ในนามของผู้เยาว์ซึ่งอยู่ในความปกครองได้",
    "     ค.) ห้ามมิให้คุณใช้บริการโดยทางมิชอบ ตัวอย่างเช่น ไม่แทรกแซงบริการหรือพยายามที่จะเข้าถึงโดยใช้วิธีการนอกเหนือไปจากที่เราได้จัดเตรียมและให้คำแนะนำกับคุณ และคุณต้องใช้บริการของเราเฉพาะตามที่กฎหมายอนุญาต รวมทั้งกฎหมายและกฎระเบียบในการควบคุมการส่งออกและการส่งออกซ้ำที่บังคับใช้ เราอาจระงับหรือหยุดการให้บริการแก่คุณหากคุณไม่ปฏิบัติตามข้อกำหนดและนโยบายของเรา หรือหากเราตรวจสอบพบพฤติกรรมที่น่าสงสัยว่าไม่ถูกต้อง",
    "     ง.) การใช้บริการนี้ไม่ได้ทำให้คุณเป็นเจ้าของสิทธิในทรัพย์สินทางปัญญาใด ๆ ในบริการหรือเนื้อหาที่คุณเข้าถึง คุณไม่สามารถใช้เนื้อหาในบริการได้ เว้นแต่ได้รับการอนุญาตจากเจ้าของเนื้อหาดังกล่าว หรือสามารถกระทำได้โดยกฎหมาย ข้อกำหนดนี้มิได้ให้สิทธิแก่คุณในการใช้การสร้างแบรนด์หรือโลโก้ใด ๆ ที่ใช้ในบริการของเรา ห้ามนำออก ปิดบัง หรือเปลี่ยนแปลงประกาศทางกฎหมายใด ๆ ที่แสดงในหรือกับบริการของเรา",
    "     จ.) ในส่วนของการใช้บริการเราอาจส่งประกาศ ข้อความ เกี่ยวกับบริการ และข้อมูลอื่น ๆ ให้แก่คุณ คุณสามารถเลือกไม่รับการสื่อสารเหล่านี้บางรายการได้",
    "     ฉ.) บริการบางอย่างของเราสามารถใช้บนอุปกรณ์เคลื่อนที่ส่วนบุคคล ห้ามใช้บริการดังกล่าวในลักษณะที่ทำให้คุณเสียสมาธิและทำให้ไม่สามารถปฏิบัติตามกฎจราจรหรือกฎหมายด้านความปลอดภัย",

    " 4. เนื้อหา",
    "     ก.) แอปพลิเคชัน และ จุดบริการของเรา (“เครื่องมือ”) เป็นเพียงเครื่องมือในการเข้าใช้บริการเท่านั้น",
    "     ข.) คุณรับทราบและเข้าใจว่าขั้นตอน ผลิตภัณฑ์ บริการ และเครื่องมือซึ่งถูกกล่าวถึงและ/หรือโฆษณา นั้นไม่ได้เป็นสิ่งที่สามารถใช้ได้กับบุคคล ผู้ป่วย หรือผู้รับบริการทุกคน",
    "     ค.) การให้บริการของผู้ประกอบวิชาชีพเวชกรรม ที่ได้รับใบอนุญาตให้ประกอบวิชาชีพเวชกรรม (“แพทย์”) พยาบาลวิชาชีพ นักโภชนาการเภสัชกร ตลอดจนผู้เชี่ยวชาญด้านสุขภาพ (“ผู้เชี่ยวชาญ”) (รวมเรียกว่า “ผู้ให้บริการ”) สามารถกระทำได้ผ่านบริการนี้ แม้ในกรณีที่คุณใช้บริการ ณ สถานที่อื่นนอกเหนือจากเคหะสถาน หรือสถานที่ที่แพทย์ใช้เป็นสถานที่ประกอบการ",
    "     ง.) เราไม่อนุญาตให้มีการดำเนินการใด ๆ ที่ขัดต่อกฎหมายและข้อบังคับใด ๆ ที่กำหนดโดยแพทยสภาแห่งประเทศไทยผ่านบริการนี้โดยเด็ดขาด",
    "     จ.) บริการการแพทย์ทางไกล",
    "         1. เป็นบริการให้คำปรึกษาเพื่อตรวจวินิจฉัยและรักษาโดยแพทย์",
    "         2. คุณอาจจำเป็นต้องเข้าพบแพทย์ ณ สถานพยาบาล โดยแพทย์จะเป็นผู้วินิจฉัยและแจ้งให้คุณทราบหากคุณจำเป็นต้องได้รับการประเมินและวินิจฉัยเพิ่มเติมทางกายภาพ",
    "         3. คุณไม่ได้รับอนุญาตให้ใช้บริการเมื่อเกิดเหตุจำเป็นทางการแพทย์กรณีฉุกเฉิน หากคุณมีภาวะฉุกเฉินทางการแพทย์ โปรดขอความช่วย เหลือทางการแพทย์ฉุกเฉินจากรถพยาบาลหรือสถานพยาบาล",
    "     ฉ.) บริการทะเบียนข้อมูลสุขภาพส่วนบุคคล (Personal Health Record)",
    "         1. เป็นบริการที่ช่วยอำนวยความสะดวกให้คุณสามารถเก็บรวบรวมข้อมูลเกี่ยวกับสุขภาพของคุณอย่างเป็นระบบ เช่น น้ำหนักความดันโลหิต ส่วนสูง ข้อมูลการแพ้ยา เป็นต้น",
    "         2. คุณสามารถอนุญาตให้ผู้ให้บริการของเราเข้าถึงข้อมูลเหล่านี้ได้กรณีที่คุณใช้บริการการแพทย์ทางไกล หรือ บริการที่ปรึกษาดูแลสุขภาพส่วนบุคคล เพื่อประโยชน์ในการให้บริการของผู้ให้บริการของเรา",
    "         3. ข้อมูลในบริการนี้ได้รวมถึงบันทึกการเข้ารับบริการการแพทย์ทางไกล และ บริการที่ปรึกษาดูแลสุขภาพส่วนบุคคล ซึ่งเป็นบันทึกจากผู้ให้บริการของเราเพื่อให้คุณใช้เป็นข้อมูลอ้างอิงในการดูแลสุขภาพของคุณได้",
    "     ช.) บริการจัดส่งยา วิตามิน อาหารเสริม และเวชภัณฑ์ (Medicine Delivery)",
    "         1. เป็นบริการที่จัดส่งยาตามคำสั่งแพทย์ รวมถึงวิตามิน อาหารเสริม และเวชภัณฑ์ (“สินค้า”)",
    "         2. ระยะเวลาในการจัดส่งอาจมีความแตกต่างไปในแต่ละพื้นที่ขึ้นอยู่กับสถานที่รับสินค้า ระยะทาง และ เหตุการณ์หรือสถานการณ์หรือภาวะการณ์ต่าง ๆ ที่เกิดขึ้นอันส่งผลต่อการขนส่งสินค้า กรุณาตรวจสอบรายละเอียดเพิ่มเติมจากเจ้าหน้าที่ของเราผ่านทางช่องทางช่วยเหลือที่ปรากฏอยู่ภายในแอปพลิเคชัน",
    "     ซ.) บริการที่ปรึกษาดูแลสุขภาพส่วนบุคคล (Personal Health Consultant)",
    "         1. เป็นบริการที่ศึกษาและจัดเตรียมขึ้นโดยผู้ให้บริการของเรา ในรูปแบบโปรแกรมดูแลสุขภาพ เพื่อช่วยคุณในการดูแลสุขภาพในด้านต่าง ๆ เช่น โปรแกรมโภชนาการเพื่อการลดน้ำหนัก เป็นต้น",
    "         2. บริการนี้เป็นบริการต่อเนื่อง คุณจำเป็นต้องตกลงยอมรับว่าคุณจะปฏิบัติตามข้อกำหนด แผน และวิธีปฏิบัติที่ผู้ให้บริการของเราได้แนะนำไว้แก่คุณอย่างเคร่งครัด",
    "         3. เมื่อคุณเลือกรับบริการนี้ คุณตกลงยอมรับว่า",
    "             •	คุณจะให้ข้อมูลที่เป็นจริงและเป็นปัจจุบันกับผู้ให้บริการของเราทั้งสิ้น ตามที่ผู้ให้บริการของเราร้องขอและเกี่ยวข้องกับการให้บริการ",
    "             •	ผลจากการให้บริการนี้จะมีความแตกต่างกันออกไปสำหรับแต่ละบุคคล ขึ้นอยู่กับหลายปัจจัย เช่น ลักษณะทางชีวภาพของคุณ พฤติกรรมการดำเนินชีวิตของคุณ เป็นต้น",
    "             •	คุณจะปฏิบัติตามข้อกำหนด แผน และวิธีปฏิบัติที่ผู้ให้บริการของเราได้แนะนำไว้แก่คุณอย่างเคร่งครัด",
    " 5. การชำระเงิน",
    "     ก.)  เมื่อคุณมีการเลือกรับหรือสั่งซื้อ บริการ ยา เวชภัณฑ์ ผลิตภัณฑ์อื่นใดภายในบริการนี้ (“รายการสั่งซื้อ”) ที่ต้องชำระเงินโดยคุณเป็นผู้ชำระเงิน คุณตกลงยินยอมที่จะทำการชำระเงินสำหรับรายการสั่งซื้อและค่าใช้จ่ายอื่น ๆ ที่เกิดขึ้นและเกี่ยวข้องกับรายการสั่งซื้อทั้งสิ้นรวมถึงภาษี และตกลงยินยอมในข้อกำหนดและเงื่อนไขบริการเพิ่มเติมของรายการสั่งซื้อ หากการสั่งซื้อไม่สำเร็จอาจเป็นเหตุให้เราต้องหยุดการให้บริการและ/หรือผลิตภัณฑ์นั้น ๆ แก่คุณ",
    "     ข.)  การสั่งซื้อ",
    "        1. มูลค่าของบริการ ยา และผลิตภัณฑ์ใด ๆ จะแสดงผลเป็นสกุลเงิน “บาท” เท่านั้น",
    "        2. เราอาจมีการคำนวณภาษีที่คุณต้องชำระตามข้อมูลมูลค่าที่ต้องชำระของคุณในขั้นตอนการสรุปรายการสั่งซื้อ",
    "        3. คุณอาจต้องรับผิดชอบค่าใช้จ่ายเพิ่มเติมใด ๆ ที่อาจรวมถึงค่าธรรมเนียมบัตรเครดิตหรือค่าดำเนินการอื่น ๆ อย่างเหมาะสมเมื่อมีการชำระเงินรายการสั่งซื้อ",
    "     ค.) ช่องทางชำระเงิน เรารับชำระเงินผ่านช่องทางระบบชำระเงินออนไลน์ เช่น บัตรเครดิต บัตรเดบิต พร้อมเพย์ (PromptPay) เป็นต้นทั้งนี้เป็นไปตามข้อกำหนดและเงื่อนไขการให้ผู้ให้บริการช่องทางชำระเงินนั้น ๆ",
    "     ง.)  เราไม่มีนโยบายในการคืนเงินค่าผลิตภัณฑ์และ/หรือบริการที่คุณได้สั่งซื้อและชำระเงินภายใต้บริการนี้ อย่างไรก็ตามเราได้กำหนดนโยบายในการคืนเงินหรือคืนสินค้าให้กับบางบริการตามที่เรากำหนด เราขอสงวนสิทธิ์ในการคืนเงินหรือคืนสินค้าให้กับคุณในกรณีที่ท่านมีการใช้บริการและมีเงื่อนไขตรงตามนโยบายคืนเงินหรือคืนสินค้าบริการ",
    "     จ.) กรณีที่คุณเลือกใช้สิทธิตามกรมธรรม์ประกันภัยที่มีอยู่กับบริษัทประกันภัย คุณจะต้องรับผิดชอบค่าใช้จ่ายที่เป็นส่วนเกินสิทธิ์ที่เราไม่สามารถเรียกร้องค่าสินไหมจากบริษัทประกันภัยที่คุณเลือกได้",

    " 6. การคุ้มครองข้อมูลส่วนบุคคล",
    "     ก.)  เราตระหนักและให้ความสำคัญในการคุ้มครองข้อมูลส่วนบุคคลของคุณ โดยคุณสามารถศึกษานโยบายความเป็นส่วนตัว (PrivacyPolicy) ของบริการนี้ได้ที่ https://www.bangkokchainhospital.com/th/privacy-policy ซึ่งจะอธิบายถึงการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล รวมถึงสิทธิที่คุณมีต่อข้อมูลส่วนบุคคลดังกล่าว",
    "     ข.)  ด้วยบริการนี้ได้รวมถึงบริการด้านสุขภาพ จึงมีความเกี่ยวข้องกับข้อมูลที่มีความละเอียดอ่อน (Sensitive Data) เช่น ข้อมูลสุขภาพเชื้อชาติ ศาสนา เป็นต้น ซึ่งเราจะทำการเก็บรวบรวม ใช้ เปิดเผย เฉพาะเท่าที่จำเป็นต่อการให้คำปรึกษา วินิจฉัยและรักษาโรค ทั้งนี้คุณจะสามารถเข้าถึงบริการดังกล่าวได้เมื่อคุณตกลงยินยอมให้เราเก็บรวบรวม ใช้ เปิดเผย ข้อมูลส่วนบุคคลดังกล่าวได้ รวมทั้งตกลงยินยอมให้เปิดเผยแก่ผู้ให้บริการภายในบริการนี้ และ/หรือ พันธมิตรของเราเฉพาะเท่าที่จำเป็นและที่คุณได้อนุญาตไว้เท่านั้น",
    "     ค.)  โดยการใช้บริการนี้ คุณได้อ่านทำความเข้าใจและตกลงยอมรับนโยบายความเป็นส่วนตัว (Privacy Policy) ตามที่เราได้ประกาศไว้ทุกประการ",

    " 7. เนื้อหาของคุณในบริการ",
    "     ก.)  บริการของเราบางส่วนอนุญาตให้คุณอัปโหลด ส่งเนื้อหามาให้ จัดเก็บ ส่งหรือรับเนื้อหาได้ คุณยังคงความเป็นเจ้าของสิทธิ์ในทรัพย์สินทางปัญญาใด ๆ ที่คุณถือสิทธิ์ในเนื้อหานั้น ๆ สรุปโดยย่อคือ อะไรที่เป็นของคุณจะยังเป็นของคุณต่อไป",
    "     ข.)  เมื่อคุณอัปโหลด ส่งเนื้อหามาให้ จัดเก็บ ส่งหรือรับเนื้อหามายังหรือผ่านบริการของเรา ถือว่าคุณได้อนุญาตให้เรา มีสิทธิ์ในเนื้อหาของคุณ ไม่ว่าที่ใดในโลก ในการใช้โฮสต์ จัดเก็บ ทำซ้ำ แก้ไข สร้างงานต่อยอดเนื้อหาของคุณ (เช่น งานการแปลภาษา การปรับเปลี่ยน หรือการเปลี่ยนแปลงอื่น ๆ ที่เราทำเพื่อให้เนื้อหาของคุณสามารถใช้งานได้ดีขึ้นร่วมกับบริการของเรา) สื่อสาร เผยแพร่ แสดงต่อสาธารณะและแจกจ่ายเนื้อหาดังกล่าว การอนุญาตให้เราใช้เนื้อหาของคุณนั้นจะเป็นไปเพื่อวัตถุประสงค์อันจำกัดในการดำเนินการการโปรโมต และการปรับปรุงบริการของเรา และเพื่อพัฒนาบริการใหม่ ๆ การอนุญาตนี้จะยังคงมีผลแม้ว่าคุณจะหยุดการใช้บริการของเราแล้วก็ตาม (ตัวอย่างเช่น สำหรับรายชื่อสถานที่ที่คุณได้เพิ่มไว้ในรายการสถานที่ของเรา) บริการบางอย่างอาจให้วิธีการในการเข้าถึงและนำเนื้อหาออกซึ่งถูกจัดหาให้กับบริการนั้น ๆ นอกจากนี้ บริการบางอย่างของเรายังมีข้อกำหนดหรือการตั้งค่าที่ทำให้การใช้เนื้อหาของเราที่ส่งให้กับบริการเหล่านั้นมีขอบเขตที่แคบลง",
    "     ค.)   ระบบอัตโนมัติของเราจะวิเคราะห์เนื้อหาของคุณ เพื่อมอบคุณลักษณะผลิตภัณฑ์ที่เกี่ยวข้องกับคุณโดยตรง เช่น การคำนวณความเสี่ยงทางด้านสุขภาพ, โฆษณาที่ปรับให้ตรงตามความต้องการของคุณ เป็นต้น การวิเคราะห์นี้จะเกิดขึ้นเมื่อมีการส่ง รับ และจัดเก็บเนื้อหา",
    "     ง.)   คุณยอมรับว่าข้อมูลใด ๆ ที่คุณส่งและรับในแอปพลิเคชันนั้น จะถูกตรวจสอบและเข้าถึงโดยและบุคคลที่เราได้มอบหมายซึ่งเรา และบุคคลที่เรามอบหมายนั้นสามารถที่จะใช้ เปิดเผย และส่งข้อมูลดังกล่าวต่อไปให้แก่บุคคลอื่นก็ได้ โดยคุณตกลงที่จะไม่คิดราคาหรือเรียกเก็บค่าธรรมเนียมใด ๆ",
    "     จ.)    คุณตระหนักว่าอาจมีการเปิดเผย การรับ และส่งข้อมูลในแอปพลิเคชันในกรณีที่กฎหมายกำหนดไว้",
    "     ฉ.)   เนื้อหา ซึ่งหมายรวมถึงเนื้อหาที่ได้ให้ไว้ในหัวข้อเรื่องคำถามสาธารณะ และคำตอบและเนื้อหาใด ๆ ที่ได้ให้ไว้ในการให้คำปรึกษาส่วนบุคคล บนแอปพลิเคชัน (“เนื้อหา”) จะอยู่ภายใต้ข้อกำหนดในการใช้งานดังต่อไปนี้ ผู้เขียนเนื้อหาดังกล่าว (“ผู้เขียน”) จะต้องรับผิดชอบเนื้อหาของตนเองแต่เพียงผู้เดียว แม้ว่าเราจะหวังว่าคุณจะได้พบว่าเนื้อหาทั้งหลายเหล่านั้นมีสาระและให้ความรู้ แต่เราหรือผู้เขียนจะไม่ให้การรับรองหรือรับประกันใด ๆ เกี่ยวกับข้อมูลที่ถูกนำเสนอหรือที่ได้ให้ไว้ภายในหรือผ่านทางเนื้อหาในเรื่องการรักษาโรคประจำตัวการกระทำต่าง ๆ หรือการใช้ยารักษาโรค",
    "     ช.)  ไม่ว่าในสถานการณ์ใด ๆ ผู้เขียน ลูกจ้างหรือสปอนเซอร์ของผู้เขียน จะไม่ต้องรับผิดต่อคุณหรือต่อบุคคลอื่นใดในค่าเสียหายหรืออันตรายอันเป็นผลมาจากการใช้ แอปพลิเคชันของคุณ ซึ่งรวมถึง ค่าเสียหายโดยตรง โดยอ้อม ค่าเสียหายพิเศษ ค่าเสียหายที่เกิดขึ้นโดยไม่ได้คาดหมาย ค่าเสียหายเชิงลงโทษ ค่าเสียหายสืบเนื่องหรือค่าเสียหายอื่น ๆ ภายใต้หลักกฎหมายใด ๆ รวมถึงแต่ไม่จำกัดเพียงการกระทำละเมิด การผิดสัญญา ความรับผิดเด็ดขาดหรือหลักกฎหมายอื่น ๆ แม้ว่าจะได้รับแจ้งถึงความเป็นไปได้ที่จะเกิดค่าเสียหายดังกล่าว โดยไม่เป็นการจำกัดในหลักการทั่วไปที่ได้กล่าวมาข้างต้น ผู้เขียน (รวมถึง ลูกจ้าง และ/หรือ สปอนเซอร์ ของผู้เขียนดังกล่าว)จะไม่มีความรับผิดโดยสิ้นเชิงสำหรับ",
    "         1. ความสูญเสียหรือความบาดเจ็บใด ๆ ที่เกิดขึ้นจากการกระทำ การละเลยหรือความประมาทเลินเล่อของผู้เขียน ไม่ว่าทั้งหมดหรือแต่บางส่วน ในการจัดหา รวบรวมหรือส่งข้อมูลภายในหรือผ่านทางเนื้อหา",
    "         2. ข้อผิดพลาด การละเลยหรือความไม่ถูกต้องใด ๆ ในข้อมูลดังกล่าว โดยไม่คำนึงถึงสาเหตุหรือความล่าช้าหรือการขัดขวางในการส่งข้อมูลดังกล่าว",
    "         3. การตัดสินใจใด ๆ ที่ได้ทำหรือการกระทำที่ได้ดำเนินการหรือไม่ได้ดำเนินการโดยเชื่อถือข้อมูลดังกล่าว",
    "     ซ.)   เรา ผู้ออกใบอนุญาตให้แก่เรา ผู้จัดหาของเรา ผู้ให้บริการ ผู้เขียนหรือบุคคลภายนอกใด ๆ ที่ได้ระบุไว้บน แอปพลิเคชันจะไม่ต้องรับผิดสำหรับความบาดเจ็บเสียหายส่วนบุคคลใด ๆ ซึ่งรวมถึงความตายอันเนื่องมาจากหรือมีสาเหตุมาจากการที่คุณใช้งาน แอปพลิเคชันหรือเนื้อหาหรือนำสิ่งเหล่านั้นไปใช้ในทางที่ผิดภายในขอบเขตอย่างเต็มที่เท่าที่ได้รับอนุญาตตามกฎหมาย ข้อเรียกร้องใด ๆ ที่เกิดขึ้นโดยเกี่ยวข้องกับการใช้งาน แอปพลิเคชันหรือเนื้อหาใด ๆของคุณจะต้องมีการเรียกร้องภายในหนึ่งปีนับตั้งแต่วันแรกของเหตุการณ์ที่ก่อให้เกิดการดำเนินการดังกล่าว การเยียวยาแก้ไขภายใต้ข้อกำหนดในการใช้งานฉบับนี้จะถูกกำหนดไว้โดยเฉพาะและจะถูกจำกัดเท่าที่ได้กำหนดไว้โดยชัดแจ้งในข้อกำหนดในการใช้งานฉบับนี้ ข้อจำกัดความรับผิดในข้อนี้จะไม่นำไปใช้กับข้อเรียกร้องสำหรับความบาดเจ็บเสียหายส่วนบุคคลหรือความตายที่มีสาเหตุมาจากความประมาทเลินเล่อหรือการที่คุณล่วงละเมิดบทบัญญัติเกี่ยวกับทรัพย์สินทางปัญญาหรือหน้าที่ของคุณในการชดใช้ค่าสินไหมทดแทนที่เกี่ยวข้องภายใต้ข้อกำหนดในการใช้งานฉบับนี้",
    " 8. เกี่ยวกับซอฟต์แวร์ในบริการของเรา",
    "     ก.)  เมื่อบริการหนึ่ง ๆ กำหนดให้ใช้หรือประกอบด้วยซอฟต์แวร์ที่สามารถดาวน์โหลดได้ ซอฟต์แวร์นี้อาจมีการอัพเดตอัตโนมัติในอุปกรณ์ของคุณเมื่อมีรุ่นหรือคุณลักษณะใหม่ให้ใช้งาน บริการบางอย่างอาจอนุญาตให้คุณปรับการตั้งค่าการอัพเดตอัตโนมัติได้",
    "     ข.)  ห้ามคุณคัดลอก ปรับเปลี่ยน แจกจ่าย จำหน่าย หรือให้เช่าส่วนหนึ่งส่วนใดของบริการของเราหรือซอฟต์แวร์ที่อยู่ในบริการของเรา และห้ามคุณดำเนินกระบวนการวิศวกรรมย้อนกลับหรือพยายามแยกซอร์สโค้ดของซอฟต์แวร์นั้น เว้นแต่กรณีที่กฎหมายกำหนดมิให้มีการจำกัดดังกล่าว หรือคุณได้รับการอนุญาตเป็นลายลักษณ์อักษรจากเรา",
    " 9. การยุติการให้บริการของเรา และการบอกเลิกสัญญา",
    "     ก.)   คุณสามารถหยุดใช้บริการของเราได้ทุกเมื่อ แม้ว่าเราจะมิได้ต้องการให้คุณทำเช่นนั้น เราอาจหยุดให้บริการแก่คุณ หรือเพิ่มหรือสร้างขีดจำกัดใหม่ ๆ ในบริการของเราได้ทุกเมื่อ",
    "     ข.)  เราจะมีสิทธิ์ใช้ดุลยพินิจของเราในการยกเลิกการใช้บริการนี้ของคุณทันที หากคุณลวงละเมิด หรือ ไม่ปฏิบัติตามข้อกำหนดใด ๆ ในข้อตกลงนี้ โดยราคาและค่าธรรมเนียมที่ได้ชำระไปแล้ว จะไม่ได้การคืนให้แก่คุณ",
    "     ค.)  เราเชื่อว่าคุณเป็นเจ้าของข้อมูลของคุณและการสงวนไว้ซึ่งการเข้าถึงข้อมูลดังกล่าวของคุณเป็นสิ่งสำคัญ หากเราหยุดให้บริการ ในกรณีที่มีเหตุผลสมควรเราจะส่งคำเตือนที่เหมาะสมถึงคุณล่วงหน้า และให้โอกาสคุณในการนำข้อมูลออกจากบริการนั้น",
    " 10. การรับประกันและข้อจำกัดความรับผิดของเรา",
    "     ก.)   เราให้บริการโดยใช้ทักษะความเชี่ยวชาญและความเอาใจใส่ในระดับที่เหมาะสมในเชิงพาณิชย์ และเราหวังว่าคุณจะพอใจในการใช้บริการดังกล่าว อย่างไรก็ตาม เราไม่รับประกันการบริการของเราในบางประการ",
    "     ข.)   นอกเหนือจากที่ระบุไว้อย่างชัดแจ้งในเงื่อนไขการใช้บริการนี้ หรือข้อกำหนดเพิ่มเติมอื่น ๆ เรามิได้รับประกันที่เฉพาะเจาะจงใด ๆ เกี่ยวกับบริการ ตัวอย่างเช่น เรามิได้รับประกันเนื้อหาภายในบริการ ระบบการทำงานเฉพาะของบริการ ความน่าเชื่อถือของบริการ ความพร้อมในการใช้งาน หรือความสามารถในการตอบสนองความต้องการของคุณ เราให้บริการ “ตามที่เป็นอยู่”",
    " 11. ความรับผิดในบริการของเรา",
    "     ทั้งนี้คุณตกลงยอมรับว่า เราไม่ต้องรับผิดในความเสียหายใด ๆ ที่เกิดขึ้นจากสาเหตุดังต่อไปนี้",
    "     1.  มีการนำบัญชีผู้ใช้ รหัสผ่าน และข้อมูลความปลอดภัยไปใช้ในลักษณะนอกเหนือจากที่บริการกำหนดไว้ ไม่ว่าจะเป็นการกระทำของผู้ใดก็ตาม",
    "     2.  เหตุสุดวิสัยต่าง ๆ หรือเหตุการณ์ที่เราไม่สามารถควบคุมได้ รวมถึงการที่อุปกรณ์ ระบบคอมพิวเตอร์แม่ข่าย ระบบสื่อสาร ระบบส่งสัญญาณ ไม่ทำงาน หรือ ได้รับการบกวนจากไวรัสคอมพิวเตอร์ หรือ การกระทำที่ไม่ชอบด้วยกฎหมาย หรือในกรณีที่เราปิดให้บริการเพื่อปรับปรุงและดูแลรักษาระบบ อันเป็นเหตุให้คุณไม่สามารถใช้บริการนี้ได้",
    "     3. ความล่าช้า ความผิดพลาด หรือความบกพร่องของระบบคอมพิวเตอร์ หรืออุปกรณ์ต่าง ๆ ของคุณหรือของเราหรือของผู้ให้บริการหรือผู้ให้บริการเครือข่ายโทรคมนาคม เว้นแต่กรณีที่ความล่าช้า ความผิดพลาด หรือความบกพร่องเกิดจากความจงใจหรือประมาทเลินเล่ออย่างร้ายแรงของเรา",
    "     4. ความล่าช้าในขั้นตอนการดำเนินการของบริการนี้",
    "     5. การที่คุณและผู้รับบริการทางการแพทย์ไม่ปฏิบัติตามเงื่อนไขการให้บริการนี้ หรือข้อกำหนด หรือข้อบังคับอื่นใดที่เกี่ยวข้อง",
    " 12. เกี่ยวกับข้อกำหนดนี้",
    "     ก.)   เราอาจปรับเปลี่ยนเงื่อนไขการใช้บริการนี้ หรือข้อกำหนดเพิ่มเติมใด ๆ ที่มีผลบังคับใช้กับบริการนี้เพื่อให้เป็นไปตามการเปลี่ยนแปลงของกฎหมายที่เกี่ยวข้อง หรือการเปลี่ยนแปลงในบริการของเรา คุณจึงควรทบทวนเงื่อนไขการใช้บริการนี้เป็นประจำ การเปลี่ยนแปลงต่าง ๆ จะไม่มีผลย้อนหลัง และจะมีผลบังคับใช้หลังจากมีการประกาศแจ้งเป็นเวลาสิบสี่วันเป็นอย่างน้อย อย่างไรก็ตาม การเปลี่ยนแปลงที่เกี่ยวกับระบบการทำงานใหม่ของบริการ หรือการเปลี่ยนแปลงด้วยเหตุผลด้านกฎหมายจะมีผลบังคับใช้ทันที หากคุณไม่ยอมรับข้อกำหนดที่แก้ไขของบริการหนึ่ง ๆ คุณควรหยุดการใช้บริการนั้น",
    "     ข.)  หากมีข้อขัดแย้งกันระหว่างเงื่อนไขการใช้บริการนี้กับข้อกำหนดเพิ่มเติม ให้ถือว่าข้อกำหนดเพิ่มเติมมีผลบังคับใช้",
    "     ค.)  หากปรากฏว่ามีข้อกำหนดใดในเงื่อนไขการใช้บริการนี้ที่ไม่สามารถบังคับใช้ได้ ข้อกำหนดดังกล่าวจะไม่ส่งผลต่อข้อกำหนดส่วนที่เหลือ",
    " 13  การใช้งานอย่างถูกต้องตามกฎหมาย",
    "     ก.)  คุณจะต้องไม่ใช้ แอปพลิเคชันและใช้บริการในลักษณะใด ๆ ที่เป็นการล่วงละเมิดกฎหมาย กฎระเบียบ สนธิสัญญา หรือภาษีศุลกากร หรือละเมิดสิทธิตามกฎหมายของบุคคลภายนอกใด ๆ หรือในลักษณะใด ๆ ที่เป็นการหมิ่นประมาทฉ้อโกง หยาบคาย ก้าวร้าวหรือหลอกลวง หรือใช้เพื่อข่มขู่ รบกวน ล่วงละเมิดหรือคุกคามผู้อื่น หรือเพื่อสร้างความเสียหายแก่ชื่อเสียงของเรา หรือสาขาหรือเราในเครือ หรือเพื่อละเมิดการรักษาความปลอดภัยบนเครือข่ายคอมพิวเตอร์ใด ๆ หรือเพื่อให้เข้าถึงบัญชีผู้ใช้งานที่คุณไม่ได้เป็นเจ้าของ และใช้ในลักษณะใด ๆ ที่เป็นการขัดขวางการใช้งานและความสุขของลูกค้าคนอื่นในการใช้บริการที่ถูกจัดทำโดยแอปพลิเคชัน",
    "     ข.)  คุณตกลงที่จะไม่กระทำการใดที่มีวัตถุประสงค์เพื่อหรืออาจคาดหมายได้ว่าจะก่อให้เกิดอันตรายแก่เรา หรือ แอปพลิเคชันหรือชื่อเสียงของเรา หรือที่อาจคาดหมายได้ว่าจะนำไปสู่การเผยแพร่ที่ไม่พึงประสงค์หรือไม่เหมาะสมแก่เราหรือแอปพลิเคชัน",
    "     ค.)  คุณสามารถใช้แอปพลิเคชันได้เฉพาะตามที่กำหนดไว้ในเงื่อนไขการใช้บริการฉบับนี้และเพื่อวัตถุประสงค์โดยชอบตามที่กฎหมายกำหนดเท่านั้นคุณจะต้องไม่ใช้ แอปพลิเคชัน ไปในทางที่ผิดไม่ว่าในทางใด คุณจะต้องไม่ใช้ซอฟท์แวร์ใด ๆ ที่ทำงานโดยอัตโนมัติในระหว่างที่คุณเข้าเชื่อมต่อและใช้งาน แอปพลิเคชัน",
    " 14. การปฏิบัติอย่างถูกต้องตามที่รัฐกำหนด",
    "     การปฏิบัติหน้าที่ของเรา ภายใต้เงื่อนไขการใช้บริการฉบับนี้จะอยู่ภายใต้กฎหมาย ระเบียบ และกฎเกณฑ์ต่าง ๆ โดยเฉพาะอย่างยิ่ง กฎระเบียบที่ควบคุมเกี่ยวกับวิธีปฏิบัติทางการแพทย์และประกาศใช้โดยแพทยสภาและกระบวนการทางกฎหมาย และจะไม่มีสิ่งใดในเงื่อนไขการใช้บริการฉบับนี้ที่จะกระทบต่อสิทธิของเราในการปฏิบัติตามการร้องขอหรือข้อกำหนดของรัฐ ของศาลหรือตามสภาพบังคับแห่งกฎหมาย ที่เกี่ยวข้องกับการใช้ แอปพลิเคชันและการใช้บริการของคุณหรือข้อมูลที่เราได้จัดทำหรือรวบรวมซึ่งเกี่ยวข้องกับการใช้งานดังกล่าว",
    " 15. การแยกออกจากกันได้และสภาพบังคับ",
    "     หากบทบัญญัติหรือส่วนใด ๆ ในเงื่อนไขการใช้บริการฉบับนี้ ไม่ชอบด้วยกฎหมาย ไม่สมบูรณ์ หรือไม่สามารถใช้บังคับได้ ไม่ว่าทั้งหมดหรือแต่บางส่วน บทบัญญัติหรือส่วนดังกล่าวจะถูกเปลี่ยนแปลงแก้ไขในขอบเขตที่น้อยที่สุดเท่าที่จำเป็นเพื่อแก้ไขข้อบกพร่องใด ๆ หรือทดแทนด้วยบทบัญญัติที่ชอบด้วยกฎหมายซึ่งมีความใกล้เคียงอย่างยิ่งกับบทบัญญัติเดิมที่ไม่สมบูรณ์หรือไม่สามารถใช้บังคับได้ และจะไม่เป็นการกระทบต่อความชอบด้วยกฎหมาย ความสมบูรณ์หรือใช้บังคับได้ ของบทบัญญัติหรือส่วนอื่นใดของข้อกำหนดในการใช้งานฉบับนี้ และบทบัญญัติอื่นของข้อกำหนดในการใช้งานฉบับนี้จะยังคงมีสมบูรณ์และใช้บังคับได้อย่างเต็มที่",
    " 16. กฎหมายที่ใช้บังคับ",
    "     ข้อตกลงนี้ให้ใช้บังคับและตีความตามกฎหมายไทยและให้ศาลไทยเป็นศาลที่มีเขตอำนาจในการพิจารณาข้อพิพาทที่เกิดขึ้นตามเงื่อนไขการใช้บริการนี้",
    " 17 ทรัพย์สินทางปัญญา",
    "     ก.)  การใช้บริการนี้ของคุณ ไม่เป็นการให้ความเป็นเจ้าของในทรัพย์สินทางปัญญาใด ที่เกี่ยวกับบริการหรือเนื้อหาที่คุณเข้าถึงแก่คุณ",
    "     ข.)  เรา และ/หรือ ผู้ให้บริการภายในบริการนี้เป็นเจ้าของในสิทธิ และประโยชน์ใดๆ ที่เกี่ยวข้องกับลิขสิทธิ์ เครื่องหมายการค้า สิทธิบัตร และทรัพย์สินทางปัญญาอื่น ๆ หรือ สิทธิใด ๆ ภายในบริการนี้ รวมถึงงานผลิตภัณฑ์ หรือการปรับปรุงแก้ไข การออกแบบ หรืองานอื่นใดที่เกิดขึ้น หรือสร้างขึ้นโดยเราหรือผู้ให้บริการภายในบริการของเรา",
    "     ค.)  เครื่องหมาย ตราสัญลักษณ์ เครื่องหมายและตราสัญลักษณ์ผสม และเครื่องหมายอื่น ๆ ของเรา ถือเป็นเครื่องหมายการค้าที่เราเป็นเจ้าของในประเทศไทยและในประเทศอื่น ๆ",
    " 19 เบ็ดเตล็ด",
    "     ก.)  คุณเข้าใจว่าการที่คุณเลือกทำเครื่องหมายลงในช่อง “ข้าพเจ้าได้อ่าน ทำความเข้าใจโดยละเอียด และตกลงยอมรับข้อกำหนดและเงื่อนไขการใช้บริการ” และเลือก “ยินยอม” เป็นการที่คุณได้ตกลงยอมรับข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้และการกระทำดังกล่าวจะถือเป็นการลงนามโดยชอบด้วยกฎหมาย",
    "     ข.)  คุณตกลงว่า เราอาจใช้ข้อมูลส่วนตัวของคุณในการแจ้งเตือน ยืนยันนัดหมาย รวมถึงการติดต่อสื่อสารอื่นใดที่เกี่ยวกับบริการให้แก่คุณ (“การติดต่อสื่อสาร”) ผ่านวิธีการทางอิเล็กทรอนิกส์ซึ่งรวมถึงแต่ไม่จำกัดเพียง",
    "         1. อีเมล โดยใช้ที่อยู่ที่คุณได้แจ้งแก่เราภายใต้บัญชีผู้ใช้ของคุณ",
    "         2. บริการส่งข้อความสั้น (“SMS”) โดยจะส่งข้อความไปยังหมายเลขโทรศัพท์มือถือที่คุณได้แจ้งแก่เราภายใต้บัญชีผู้ใช้ของคุณ",
    "         3.  ระบบแจ้งเตือนบนอุปกรณ์พกพาของคุณ",
    "         4. การประกาศการติดต่อสื่อสารลงบนเว็บไซต์",
    "     ค.)  หากบทบัญญัติใดในเงื่อนไขการใช้บริการนี้เป็นอัน ไม่สมบูรณ์ ไม่ชอบด้วยกฎหมาย หรือไม่สามารถใช้บังคับได้ ตามคำสั่งศาลหรือสถาบันอื่นที่มีเขตอำนาจ ไม่ว่าด้วยเหตุใด บทบัญญัติดังกล่าวจะถูกตัดออกหรือจำกัดไว้ในขอบเขตที่น้อยที่สุดที่จะทำให้บทบัญญัติส่วนที่เหลือในเงื่อนไขการใช้บริการนี้มีผลใช้บังคับได้อย่างเต็มที่ต่อไป การที่เราไม่ใช้หรือบังคับตามสิทธิหรือบทบัญญัติใด ๆ ในเงื่อนไขการใช้บริการนี้จะไม่ถือเป็นการสละสิทธิหรือบทบัญญัติ",
  ]);

  const handleClickRegister = () => {
    window.location.href = "/register";
  };
  return (
    <>
      <DefaultNavbar routes={routes} sticky />
      <MKBox
        position="absolute"
        top={0}
        left={0}
        zIndex={1}
        width="100%"
        minHeight="100vh"
        sx={{
          position: "relative",
          display: "flex",
          flexDirection: "column",
          justifyContent: "center",
          alignItems: "flex-end",
          overflowY: "scroll",
          "&::before": {
            content: '""',
            position: "absolute",
            top: 0,
            right: 0,
            bottom: 0,
            left: 0,
            backgroundImage: `url(${bgImage})`,
            backgroundSize: "cover",
            backgroundPosition: "center",
            backgroundRepeat: "no-repeat",
            opacity: 0.8, // คุณสามารถปรับค่าโปร่งแสงของรูปภาพที่นี่
            filter: "blur(2px)", // คุณสามารถปรับค่าเบลอที่นี่
            zIndex: -1,
          },
        }}
      >
        <Container
          sx={{
            display: "inline-block",
            flexDirection: "column",
            justifyContent: "center",
            height: {
              xs: "calc(115vh - 56px)",
              sm: "calc(100vh - 64px)",
              md: "calc(80vh - 64px)",
              lg: "calc(80vh - 64px)",
            },
            marginTop: {
              xs: "calc(25vh - 56px)",
              sm: "calc(30vh - 64px)",
            },
          }}
        >
          <Card elevation={5} sx={{ maxWidth: "800px", marginRight: "2%", marginBottom: "20px" }}>
            <MKBox
              display="flex"
              alignItems="center"
              justifyContent="center"
              p={2}
              sx={{
                backgroundColor: "#01817a",
                borderTopLeftRadius: "0.7rem",
                borderTopRightRadius: "0.7rem",
              }}
            >
              <MKTypography
                style={{
                  color: "white",
                  fontSize: "0.9rem",
                  fontWeight: "bold",
                }}
              >
                ข้อกำหนดและเงื่อนไขการใช้บริการ Smart Appointments (นัดหมายออนไลน์)
              </MKTypography>
            </MKBox>
            <CardContent>
              <Paper
                sx={{
                  overflowY: "auto",
                  maxHeight: "300px",
                  padding: "#808080",
                  background: "#e2e2e2",
                }}
              >
                <Typography sx={{ fontWeight: "bold", fontSize: "12px", marginLeft: "10px" }}>
                  {data.map((item, index) => (
                    <p key={index}>{item.replace(/ /g, "\u00a0")}</p>
                  ))}
                </Typography>

                <FormControlLabel
                  sx={{
                    fontSize: "12px",
                    marginLeft: "10px",
                    "& .MuiCheckbox-root": {
                      height: "20px", // ปรับความสูงตามที่คุณต้องการ
                      width: "20px", // ปรับความกว้างตามที่คุณต้องการ
                    },
                  }}
                  control={
                    <Checkbox
                      checked={isChecked}
                      onChange={(e) => setChecked(e.target.checked)}
                      name="checked"
                      color="primary"
                      sx={{
                        border: "1px solid #000", // กรอบสี่เหลี่ยมสีดำ
                        "&:hover": {
                          border: "1px solid #000", // กรอบสี่เหลี่ยมสีดำเมื่อ hover
                        },
                        "&.Mui-checked": {
                          border: "1px solid #000", // กรอบสี่เหลี่ยมสีดำเมื่อถูกเลือก
                        },
                        width: "0%",
                      }}
                    />
                  }
                  label="ข้าพเจ้าได้อ่าน และยอมรับข้อกำหนด และเงื่อนไขการใช้บริการ"
                />
              </Paper>

              <Box mt={2}>
                <Button
                  variant="contained"
                  style={{ backgroundColor: "#367f7a", color: "white" }}
                  disabled={!isChecked}
                  onClick={() => {
                    handleClickRegister();
                  }}
                >
                  สมัครสมาชิก
                </Button>
              </Box>
            </CardContent>
          </Card>
        </Container>
      </MKBox>
    </>
  );
}

export default Agreement;
